In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [12]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [19]:
df = pd.concat([india_weather , us_weather], keys = [1,2])
df.reindex(axis = 0)
df

         city  temperature  humidity
1 0    mumbai           32        80
  1     delhi           45        60
  2  banglore           30        78
2 0  new york           21        68
  1   chicago           14        65
  2   orlando           35        75

In [20]:
df.loc[1]

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78